Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: While the Ctrl key is held down, the NumLock key produces the key code of Pause, so use ^Pause in hotkeys instead of ^NumLock.
fr: Tant que la touche Ctrl est maintenue enfoncée, la touche Verr Num produit le code de la touche Pause, utilisez donc ^ Pause dans les hotkeys au lieu de ^NumLock

source: While the Ctrl key is held down, the ScrollLock key produces the key code of CtrlBreak, but can be differentiated from Pause by scan code.
fr: Tant que la touche Ctrl est maintenue enfoncée, la touche Arrêt défil produit le code de la touche CtrlBreak, mais peut être différenciée de Pause par le code de balayage.

source: While the Ctrl key is held down, the Pause key produces the key code of CtrlBreak and NumLock produces Pause, so use ^CtrlBreak in hotkeys instead of ^Pause.
fr: Tant que la touche Ctrl est maintenue enfoncée, la touche Pause produit le code de la touche CtrlBreak et Verr Num produit Pause, utilisez donc ^ CtrlBreak dans les hotkeys au lieu de ^Pause.

source: While the text to replace your typed text goes on the right of the second pair of colons.
fr: Le texte à utiliser pour le remplacement va à droite de la seconde paire de deux-points.

source: Whitespace can also be preserved by preceding the space or tab with an escape character, except for whitespace at the end of a line.
fr: Les espacements peuvent aussi être conservés en précédant l'espace ou la tabulation d'un caractère d'échappement, sauf pour l'espacement en fin de ligne.

source: Why am I seeing this?
fr: Pourquoi vois-je ceci ?

source: Why are the non-ASCII characters in my script displaying or sending incorrectly?
fr: Pourquoi les caractères hors ASCII de mon script sont-ils affichés ou envoyés incorrectement ?

source: Why do Hotstrings, Send, and Click have no effect in certain games?
fr: Pourquoi les Hotstrings, Send, et Click n'ont aucun effet dans certains jeux ?

source: Why do some lines in my script never execute?
fr: Pourquoi certaines lignes de mon script ne s'exécutent-elles jamais ?

source: Why doesn't my script work on Windows xxx even though it worked on a previous version?
fr: Pourquoi mon script ne marche-t-il pas sur Windows xxx alors qu'il marchait sur une version précédente ?

source: Why don't Hotstrings, Send, and MouseClick work in certain games?
fr: Pourquoi les Hotstrings, Send, et Click n'ont aucun effet dans certains jeux ?

source: Why is the Run command unable to launch my game or program?
fr: Pourquoi la commande Run échoue-t-elle à lancer un jeu ou un programme ?

source: WinActivate, Untitled - Notepad
fr: WinActivate, Sans titre - Bloc-notes

source: WinClose Script's File Name.ahk - AutoHotkey
fr: WinClose Nom du Fichier de Script.ahk - AutoHotkey

source: WinWaitActive Untitled - Notepad
fr: WinWaitActive Sans titre - Bloc-notes

source: WinWaitActive, Untitled - Notepad
fr: WinWaitActive, Sans titre - Bloc-notes

source: Window Spy - Displays various information about a window.
fr: Window Spy - Affiche diverses informations à propos d'une fenêtre.

source: Window specific hotkeys/hotstrings
fr: Hotkeys/hotstrings propres à une fenêtre

source: With AutoHotkey installed, there are several ways to run a script:
fr: Avec AutoHotkey installé, il y a différente manières d'exécuter un script :

source: With Internet Explorer, perhaps the most reliable method is to use DllCall() and COM as demonstrated at www.autohotkey.com/forum/topic19256.html.
fr: Avec Internet Explorer, peut-être que la méthode la plus robuste est d'utiliser DllCall() et COM comme montré ici www.autohotkey.com/forum/topic19256.html.

source: With the exception of IfMsgBox, these are all obsolete and generally should be avoided in new scripts.
fr: A l'exception de IfMsgBox, toutes sont obsolètes et devraient généralement être évitées dans de nouveaux scripts.

source: Within an open Explorer window, you can right-click any .ahk file and select "Compile Script" (only available if the script compiler option was chosen when AutoHotkey was installed).
fr: Dans une fenêtre de l'explorateur de fichier, il est possible de clic droit tout fichier .ahk et de choisir "Compile Script" (Compiler le Script) (seulement disponible si l'option compilateur de script a été choisie à l'installation de AutoHotkey).

source: Within unquoted text, the following characters have special meaning:
fr: Dans du texte sans guillemets, les caractères suivants ont une signification spéciale :

source: Without them, only the first line in the block is called.
fr: Sans eux, seule la première ligne du bloc est appelée.

source: Without them, programming and scripting would be much more tedious.
fr: Sans elles, la programmation et le scripting seraient beaucoup plus fastidieux.

source: Works compiled?
fr: Fonctionne en compilé?

source: Writing a plain word (consisting of alphanumeric characters, underscore and non-ASCII characters) to the left of : is equivalent to enclosing that word in quotation marks.
fr: Ecrire un mot ordinaire (constitué de caractères alphanumériques, de tirets du huit et de caractères non-ASCII) à gauche de : équivaut à mettre ce mot entre guillemets.

source: Yes
fr: Oui

source: Yes, they do!
fr: Oui, en effet !

source: Yes.
fr: Oui.

source: You are using MyVar to store the return value of the function that is to the right of the := operator.
fr: MaVar est utilisée pour stocker la valeur retour de la fonction à droite de l'opérateur :=.

source: You can also get help or find many useful scripts on our friendly discussion forum.
fr: De l'aide peut aussi être demandée, ainsi que de nombreux scripts utiles trouvés, sur notre forum de discussion amicale.

source: You can also try searching the forum for a keywords like RawInput*, USB HID or AHKHID.
fr: Vous pouvez également essayer de rechercher sur le forum des mots clés tels que RawInput *, USB HID ou AHKHID.

source: You can change the action by replacing the Send, = line with line(s) of your choice.
fr: L'action peut être modifiée en remplaçant la ligne Send, = avec des lignes quelconques.

source: You can copy and paste most examples on this page.
fr: La plupart des exemples sur cette page peuvent être copiés-collés.

source: You can define a custom combination of two (and only two) keys (except joystick buttons) by using & between them.
fr: Une combinaison personnalisée de deux (et seulement deux) touches (sauf les boutons de joystick) peut être définie en utilisant & entre les deux touches.

source: You can do math in parameters if you force an expression with a single %, but that will not be covered.
fr: Il est possible de faire des calculs dans les paramètres en forçant une expression avec un seul %, mais ce ne sera pas abordé ici.

source: You can do math in them:
fr: Des calculs peuvent être effectués :

source: You can do this by setting it to "", also known as an empty string.
fr: en la définissant à "", aussi appelé chaîne de caractère vide.

source: You can tell if a script has the keyboard hook by opening its main window and selecting "View->Key history" from the menu bar.
fr: Vous pouvez déterminer si un script utilise le hook clavier en ouvrant sa fenêtre principale et en sélectionnant "View->Key History" dans la barre de menu.

source: You can tell what a command is by looking at its syntax (the way it looks).
fr: Une commande se reconnaît à sa syntaxe.

source: You can then type a name for the script (taking care not to erase the .ahk extension if it is visible).
fr: Il est ensuite possible de taper un nom pour le script (en s'assurant de ne pas effacer l'extension .ahk si elle est visible).

source: You can usually edit a script file by right clicking it and selecting Edit Script.
fr: Il est en général possible de modifier un fichier de script par un clic droit dessus et en sélectionnant Edit Script (modifier le script).

source: You cannot merge commands
fr: Ne pas fusionner de commandes

source: You cannot put commands inside the parameters of other commands.
fr: Il est impossible de mettre des commandes en paramètres d'autres commandes.

source: You cannot use variables in your keys with dot notation.
fr: Il est impossible d'utiliser des variables dans les clés avec la notation point.

source: You do not need to wrap common letters, numbers or even some symbols such as . (period) in curly brackets.
fr: Il n'y a pas besoin de mettre entre accolades lettres, chiffres ou même certains symboles comme . (point).

source: You have a list of things where each thing has a name, such as the characteristics of a fruit (this would be referred to as an associative array)
fr: Une liste d'éléments où chacun a un nom, comme les caractéristiques d'un fruit (qui serait appelée tableau associatif)

source: You might be wondering "How the crud am I supposed to know that ^ means Ctrl?!".
fr: Il est légitime de se demander "Comment je suis censé savoir que ^ signifie Ctrl ?!".

source: You need to fix the error in your script before you can get your tray icon back.
fr: Il faut résoudre l'erreur dans le script pour pouvoir récupérer l'icône de la zone de notifications.

source: You ran AutoHotkey without telling it which script file to run, and it couldn't find a script in either of the usual places.
fr: AutoHotkey a été lancé sans lui dire quel fichier de script exécuter, et il n'a pas pu trouver un script dans aucun des endroits habituels.

source: You should also try running the game in windowed mode, if possible.
fr: Vous devriez également essayer d'exécuter le jeu en mode fenêtré, si possible.

source: You should get a prompt asking whether you want to install with default options.
fr: Devrait suivre une fenêtre demandant si l'installation est à faire avec les options par défaut ou non.

source: You should then see AutoHotkey Help File.
fr: AutoHotkey Help File devrait ensuite être visible.

source: You want to have a numbered list of things, such as a grocery list (this would be referred to as an indexed array)
fr: Une liste ordonnée d'éléments, comme une liste de course (qui serait appelée tableau indexé)

source: You want to represent a grid, perhaps for a board game (this would be done with nested objects)
fr: La représentation d'une grille, peut-être pour un jeu de plateau (ce serait fait avec des objets imbriqués)

source: You will get a message box with the word "Yellow", because that is what we set the key Color to in the previous section.
fr: La boîte de dialogue contiendra "Jaune", puisque c'est ce à quoi Couleur a été définie dans la section précédente.

source: You will learn a lot this way by reading the documentation, reading errors and learning what works and what doesn't.
fr: Beaucoup peut être appris ainsi en lisant la documentation, en lisant les erreurs et en apprenant ce qui marche et ce qui ne marche pas.

source: Your Documents (or My Documents) folder.
fr: Le dossier Documents (ou Mes Documents).

source: Your code will run perfectly fine without it, but it will be a major headache for you and other to read your code.
fr: Le code s'exécute parfaitement sans, mais ce serait prise de tête pour tout le monde de lire le code.

source: Your first script is done.
fr: Un premier script terminé.

source: ^VK24::MsgBox You pressed Home or NumpadHome while holding down Control.
fr: ^VK24::MsgBox Vous avez appuyé sur Début ou PavnumDébut tout en maintenant la touche Ctrl enfoncée.

source: ^a::MsgBox You pressed Control-A while Notepad is active.
fr: ^a::MsgBox Vous avez appuyé sur Ctrl-A pendant que Notepad était actif.

source: ahk, autohotkey, tutorial, beginners guide
fr: ahk, autohotkey, tutoriel, guide débutant

source: b is the B key and 5 is the 5 key.
fr: b c'est la touche B et 5 c'est la touche 5.

source: either the specified number of times or until break is encountered.
fr: soit un nombre de fois spécifié ou jusqu'à un arrêt via break.

source: en
fr: fr

source: explanations of various things you need to know.
fr: explications de différentes choses à savoir.

source: for n, GivenPath in A_Args
fr: for n, CheminDonné in A_Args

source: how to write scripts.
fr: comment écrire des scripts.

source: http://en.wikipedia.org/wiki/Breakpoint
fr: https://fr.wikipedia.org/wiki/Point_d%27arr%C3%AAt_(informatique)

source: http://windows.microsoft.com/en-US/windows7/What-is-User-Account-Control
fr: https://fr.wikipedia.org/wiki/User_Account_Control

source: http://www.autoitscript.com/
fr: https://www.autoitscript.com/

source: https://en.wikipedia.org/wiki/Indentation_style
fr: https://fr.wikipedia.org/wiki/Style_d%27indentation

source: if (Color = "Red" or Color = "Green" or Color = "Blue"
fr: if (Couleur = "Rouge" or Couleur = "Vert" or Couleur = "Bleu"

source: if (MyVar = 5)
fr: if (MaVar = 5)

source: if (Number = 6)
fr: if (Nombre = 6)

source: if (OutputVar = "Bill")
fr: if (VarSortie = "Bill")

source: if (OutputVar2 = "yes")
fr: if (VarSortie2 = "oui")

source: if (Var != Number)
fr: if (Var != Nombre)

source: if (Var1 >= Low and Var1 <= High)
fr: if (Var1 >= Bas and Var1 <= Haut)

source: if (car = "old")
fr: if (voiture = "vieille")

source: if (wheels = "flat")
fr: if (pneus = "à plat")

source: if KeepWinZRunning
fr: if ContinuerExecutionWinZ

source: if Number = 6
fr: if Nombre = 6

source: if Var1 between %Low% and %High%
fr: if Var1 between %Bas% and %Haut%

source: if WinExist(ScriptPath " ahk_class AutoHotkey")
fr: if WinExist(CheminScript " ahk_class AutoHotkey")

source: if not KeepWinZRunning
fr: if not ContinuerExecutionWinZ

source: it affects all continuation sections physically beneath it.
fr: elle affecte toutes les sections de continuation sous elle.

source: keyboard,keys,key,mouse,buttons,button,joystick,create,hotkeys,hotkey,macros
fr: clavier,touches,touche,souris,boutons,bouton,joystick,créer,hotkeys,hotkey,macros

source: normal named labels, hotkey labels and hotstring labels.
fr: les labels nommés normaux, les labels hotkey et les labels hotstring.

source: once while the subroutine is running and again after it returns.
fr: une fois pendant l'exécution du sous-programme et encore une fois après sa fin.

source: return "a value"
fr: return "une valeur"

source: rownum := A_Index
fr: numeroLigne := A_Index

source: rowtext := A_LoopField
fr: texteLigne := A_LoopField

source: scripts/ContextSensitiveHelp.htm
fr: index.htm#ContextSensitiveHelp

source: scripts/MsgBoxButtonNames.htm
fr: scripts/index.htm#MsgBoxButtonNames

source: scripts/Numpad000.htm
fr: scripts/index.htm#Numpad000

source: second := "target"
fr: deuxième := "cible"

source: t := "column 1`tcolumn 2`nvalue 1`tvalue 2"
fr: t := "colonne 1`tcolonne 2`nvaleur 1`tvaleur 2"

source: target := 42
fr: cible := 42

source: the AutoHotkey interpreter, the script, any files it includes, and any files it has incorporated via the FileInstall command.
fr: l'interpréteur AutoHotkey, le script, tout fichier que le script inclut, et tout fichier incorporé via la commande FileInstall.

source: they affect all hotkeys and hotstrings physically beneath them in the script.
fr: elles affectent tous les hotkeys et hotstrings situés sous elles dans le script.

source: this_is_a_label:
fr: ceci_est_un_label:

source: using a joystick as a mouse.
fr: utilisation d'un joystick comme souris.

source: ~Tilde affects how custom modifier keys work
fr: ~ Tilde affecte le fonctionnement des touches de modification personnalisées

source: ; This is not a comment; it is literal.
fr: ; Ceci n'est pas un commentaire ; ceci est littéral.

source: ©2003-2014 Chris Mallett, portions ©AutoIt Team and the AHK community
fr: ©2003-2014 Chris Mallett, certaines portions ©l'équipe de AutoIt et la communauté AHK
